Microchip-MPLAB-Harmony/motor_control/apps/pmsm_foc_encoder_lx7720_sam_rh71_ek/firmware/src/packs/ATSAMRH71F20C_DFP/component/ip1553.h
/* -------- IP1553_TXBAER : (IP1553 Offset: 0x50) (R/W 32) Tx Buffer Access Error Register -------- */
#define IP1553_TXBAER_TER0_Pos                _U_(0)                                               /**< (IP1553_TXBAER) Transmit error 0, x with x=[0-31] Position */
#define IP1553_TXBAER_TER0_Msk                (_U_(0x1) << IP1553_TXBAER_TER0_Pos)                 /**< (IP1553_TXBAER) Transmit error 0, x with x=[0-31] Mask */
#define IP1553_TXBAER_TER0(value)             (IP1553_TXBAER_TER0_Msk & ((value) << IP1553_TXBAER_TER0_Pos))
#define IP1553_TXBAER_TER1_Pos                _U_(1)                                               /**< (IP1553_TXBAER) Transmit error 1, x with x=[0-31] Position */
#define IP1553_TXBAER_TER1_Msk                (_U_(0x1) << IP1553_TXBAER_TER1_Pos)                 /**< (IP1553_TXBAER) Transmit error 1, x with x=[0-31] Mask */
#define IP1553_TXBAER_TER1(value)             (IP1553_TXBAER_TER1_Msk & ((value) << IP1553_TXBAER_TER1_Pos))
#define IP1553_TXBAER_TER2_Pos                _U_(2)                                               /**< (IP1553_TXBAER) Transmit error 2, x with x=[0-31] Position */
#define IP1553_TXBAER_TER2_Msk                (_U_(0x1) << IP1553_TXBAER_TER2_Pos)                 /**< (IP1553_TXBAER) Transmit error 2, x with x=[0-31] Mask */
#define IP1553_TXBAER_TER2(value)             (IP1553_TXBAER_TER2_Msk & ((value) << IP1553_TXBAER_TER2_Pos))
#define IP1553_TXBAER_TER3_Pos                _U_(3)                                               /**< (IP1553_TXBAER) Transmit error 3, x with x=[0-31] Position */
#define IP1553_TXBAER_TER3_Msk                (_U_(0x1) << IP1553_TXBAER_TER3_Pos)                 /**< (IP1553_TXBAER) Transmit error 3, x with x=[0-31] Mask */
#define IP1553_TXBAER_TER3(value)             (IP1553_TXBAER_TER3_Msk & ((value) << IP1553_TXBAER_TER3_Pos))
#define IP1553_TXBAER_TER4_Pos                _U_(4)                                               /**< (IP1553_TXBAER) Transmit error 4, x with x=[0-31] Position */
#define IP1553_TXBAER_TER4_Msk                (_U_(0x1) << IP1553_TXBAER_TER4_Pos)                 /**< (IP1553_TXBAER) Transmit error 4, x with x=[0-31] Mask */
#define IP1553_TXBAER_TER4(value)             (IP1553_TXBAER_TER4_Msk & ((value) << IP1553_TXBAER_TER4_Pos))
#define IP1553_TXBAER_TER5_Pos                _U_(5)                                               /**< (IP1553_TXBAER) Transmit error 5, x with x=[0-31] Position */
#define IP1553_TXBAER_TER5_Msk                (_U_(0x1) << IP1553_TXBAER_TER5_Pos)                 /**< (IP1553_TXBAER) Transmit error 5, x with x=[0-31] Mask */
#define IP1553_TXBAER_TER5(value)             (IP1553_TXBAER_TER5_Msk & ((value) << IP1553_TXBAER_TER5_Pos))
#define IP1553_TXBAER_TER6_Pos                _U_(6)                                               /**< (IP1553_TXBAER) Transmit error 6, x with x=[0-31] Position */
#define IP1553_TXBAER_TER6_Msk                (_U_(0x1) << IP1553_TXBAER_TER6_Pos)                 /**< (IP1553_TXBAER) Transmit error 6, x with x=[0-31] Mask */
#define IP1553_TXBAER_TER6(value)             (IP1553_TXBAER_TER6_Msk & ((value) << IP1553_TXBAER_TER6_Pos))
#define IP1553_TXBAER_TER7_Pos                _U_(7)                                               /**< (IP1553_TXBAER) Transmit error 7, x with x=[0-31] Position */
#define IP1553_TXBAER_TER7_Msk                (_U_(0x1) << IP1553_TXBAER_TER7_Pos)                 /**< (IP1553_TXBAER) Transmit error 7, x with x=[0-31] Mask */
#define IP1553_TXBAER_TER7(value)             (IP1553_TXBAER_TER7_Msk & ((value) << IP1553_TXBAER_TER7_Pos))
#define IP1553_TXBAER_TER8_Pos                _U_(8)                                               /**< (IP1553_TXBAER) Transmit error 8, x with x=[0-31] Position */
#define IP1553_TXBAER_TER8_Msk                (_U_(0x1) << IP1553_TXBAER_TER8_Pos)                 /**< (IP1553_TXBAER) Transmit error 8, x with x=[0-31] Mask */
#define IP1553_TXBAER_TER8(value)             (IP1553_TXBAER_TER8_Msk & ((value) << IP1553_TXBAER_TER8_Pos))
#define IP1553_TXBAER_TER9_Pos                _U_(9)                                               /**< (IP1553_TXBAER) Transmit error 9, x with x=[0-31] Position */
#define IP1553_TXBAER_TER9_Msk                (_U_(0x1) << IP1553_TXBAER_TER9_Pos)                 /**< (IP1553_TXBAER) Transmit error 9, x with x=[0-31] Mask */
#define IP1553_TXBAER_TER9(value)             (IP1553_TXBAER_TER9_Msk & ((value) << IP1553_TXBAER_TER9_Pos))
#define IP1553_TXBAER_TER10_Pos               _U_(10)                                              /**< (IP1553_TXBAER) Transmit error 10, x with x=[0-31] Position */
#define IP1553_TXBAER_TER10_Msk               (_U_(0x1) << IP1553_TXBAER_TER10_Pos)                /**< (IP1553_TXBAER) Transmit error 10, x with x=[0-31] Mask */
#define IP1553_TXBAER_TER10(value)            (IP1553_TXBAER_TER10_Msk & ((value) << IP1553_TXBAER_TER10_Pos))
#define IP1553_TXBAER_TER11_Pos               _U_(11)                                              /**< (IP1553_TXBAER) Transmit error 11, x with x=[0-31] Position */
#define IP1553_TXBAER_TER11_Msk               (_U_(0x1) << IP1553_TXBAER_TER11_Pos)                /**< (IP1553_TXBAER) Transmit error 11, x with x=[0-31] Mask */
#define IP1553_TXBAER_TER11(value)            (IP1553_TXBAER_TER11_Msk & ((value) << IP1553_TXBAER_TER11_Pos))
#define IP1553_TXBAER_TER12_Pos               _U_(12)                                              /**< (IP1553_TXBAER) Transmit error 12, x with x=[0-31] Position */
#define IP1553_TXBAER_TER12_Msk               (_U_(0x1) << IP1553_TXBAER_TER12_Pos)                /**< (IP1553_TXBAER) Transmit error 12, x with x=[0-31] Mask */
#define IP1553_TXBAER_TER12(value)            (IP1553_TXBAER_TER12_Msk & ((value) << IP1553_TXBAER_TER12_Pos))
#define IP1553_TXBAER_TER13_Pos               _U_(13)                                              /**< (IP1553_TXBAER) Transmit error 13, x with x=[0-31] Position */
#define IP1553_TXBAER_TER13_Msk               (_U_(0x1) << IP1553_TXBAER_TER13_Pos)                /**< (IP1553_TXBAER) Transmit error 13, x with x=[0-31] Mask */
#define IP1553_TXBAER_TER13(value)            (IP1553_TXBAER_TER13_Msk & ((value) << IP1553_TXBAER_TER13_Pos))
#define IP1553_TXBAER_TER14_Pos               _U_(14)                                              /**< (IP1553_TXBAER) Transmit error 14, x with x=[0-31] Position */
#define IP1553_TXBAER_TER14_Msk               (_U_(0x1) << IP1553_TXBAER_TER14_Pos)                /**< (IP1553_TXBAER) Transmit error 14, x with x=[0-31] Mask */
#define IP1553_TXBAER_TER14(value)            (IP1553_TXBAER_TER14_Msk & ((value) << IP1553_TXBAER_TER14_Pos))
#define IP1553_TXBAER_TER15_Pos               _U_(15)                                              /**< (IP1553_TXBAER) Transmit error 15, x with x=[0-31] Position */
#define IP1553_TXBAER_TER15_Msk               (_U_(0x1) << IP1553_TXBAER_TER15_Pos)                /**< (IP1553_TXBAER) Transmit error 15, x with x=[0-31] Mask */
#define IP1553_TXBAER_TER15(value)            (IP1553_TXBAER_TER15_Msk & ((value) << IP1553_TXBAER_TER15_Pos))
#define IP1553_TXBAER_TER16_Pos               _U_(16)                                              /**< (IP1553_TXBAER) Transmit error 16, x with x=[0-31] Position */
#define IP1553_TXBAER_TER16_Msk               (_U_(0x1) << IP1553_TXBAER_TER16_Pos)                /**< (IP1553_TXBAER) Transmit error 16, x with x=[0-31] Mask */
#define IP1553_TXBAER_TER16(value)            (IP1553_TXBAER_TER16_Msk & ((value) << IP1553_TXBAER_TER16_Pos))
#define IP1553_TXBAER_TER17_Pos               _U_(17)                                              /**< (IP1553_TXBAER) Transmit error 17, x with x=[0-31] Position */
#define IP1553_TXBAER_TER17_Msk               (_U_(0x1) << IP1553_TXBAER_TER17_Pos)                /**< (IP1553_TXBAER) Transmit error 17, x with x=[0-31] Mask */
#define IP1553_TXBAER_TER17(value)            (IP1553_TXBAER_TER17_Msk & ((value) << IP1553_TXBAER_TER17_Pos))
#define IP1553_TXBAER_TER18_Pos               _U_(18)                                              /**< (IP1553_TXBAER) Transmit error 18, x with x=[0-31] Position */
#define IP1553_TXBAER_TER18_Msk               (_U_(0x1) << IP1553_TXBAER_TER18_Pos)                /**< (IP1553_TXBAER) Transmit error 18, x with x=[0-31] Mask */
#define IP1553_TXBAER_TER18(value)            (IP1553_TXBAER_TER18_Msk & ((value) << IP1553_TXBAER_TER18_Pos))
#define IP1553_TXBAER_TER19_Pos               _U_(19)                                              /**< (IP1553_TXBAER) Transmit error 19, x with x=[0-31] Position */
#define IP1553_TXBAER_TER19_Msk               (_U_(0x1) << IP1553_TXBAER_TER19_Pos)                /**< (IP1553_TXBAER) Transmit error 19, x with x=[0-31] Mask */
#define IP1553_TXBAER_TER19(value)            (IP1553_TXBAER_TER19_Msk & ((value) << IP1553_TXBAER_TER19_Pos))
#define IP1553_TXBAER_TER20_Pos               _U_(20)                                              /**< (IP1553_TXBAER) Transmit error 20, x with x=[0-31] Position */
#define IP1553_TXBAER_TER20_Msk               (_U_(0x1) << IP1553_TXBAER_TER20_Pos)                /**< (IP1553_TXBAER) Transmit error 20, x with x=[0-31] Mask */
#define IP1553_TXBAER_TER20(value)            (IP1553_TXBAER_TER20_Msk & ((value) << IP1553_TXBAER_TER20_Pos))
#define IP1553_TXBAER_TER21_Pos               _U_(21)                                              /**< (IP1553_TXBAER) Transmit error 21, x with x=[0-31] Position */
#define IP1553_TXBAER_TER21_Msk               (_U_(0x1) << IP1553_TXBAER_TER21_Pos)                /**< (IP1553_TXBAER) Transmit error 21, x with x=[0-31] Mask */
#define IP1553_TXBAER_TER21(value)            (IP1553_TXBAER_TER21_Msk & ((value) << IP1553_TXBAER_TER21_Pos))
#define IP1553_TXBAER_TER22_Pos               _U_(22)                                              /**< (IP1553_TXBAER) Transmit error 22, x with x=[0-31] Position */
#define IP1553_TXBAER_TER22_Msk               (_U_(0x1) << IP1553_TXBAER_TER22_Pos)                /**< (IP1553_TXBAER) Transmit error 22, x with x=[0-31] Mask */
#define IP1553_TXBAER_TER22(value)            (IP1553_TXBAER_TER22_Msk & ((value) << IP1553_TXBAER_TER22_Pos))
#define IP1553_TXBAER_TER23_Pos               _U_(23)                                              /**< (IP1553_TXBAER) Transmit error 23, x with x=[0-31] Position */
#define IP1553_TXBAER_TER23_Msk               (_U_(0x1) << IP1553_TXBAER_TER23_Pos)                /**< (IP1553_TXBAER) Transmit error 23, x with x=[0-31] Mask */
#define IP1553_TXBAER_TER23(value)            (IP1553_TXBAER_TER23_Msk & ((value) << IP1553_TXBAER_TER23_Pos))
#define IP1553_TXBAER_TER24_Pos               _U_(24)                                              /**< (IP1553_TXBAER) Transmit error 24, x with x=[0-31] Position */
#define IP1553_TXBAER_TER24_Msk               (_U_(0x1) << IP1553_TXBAER_TER24_Pos)                /**< (IP1553_TXBAER) Transmit error 24, x with x=[0-31] Mask */
#define IP1553_TXBAER_TER24(value)            (IP1553_TXBAER_TER24_Msk & ((value) << IP1553_TXBAER_TER24_Pos))
#define IP1553_TXBAER_TER25_Pos               _U_(25)                                              /**< (IP1553_TXBAER) Transmit error 25, x with x=[0-31] Position */
#define IP1553_TXBAER_TER25_Msk               (_U_(0x1) << IP1553_TXBAER_TER25_Pos)                /**< (IP1553_TXBAER) Transmit error 25, x with x=[0-31] Mask */
#define IP1553_TXBAER_TER25(value)            (IP1553_TXBAER_TER25_Msk & ((value) << IP1553_TXBAER_TER25_Pos))
#define IP1553_TXBAER_TER26_Pos               _U_(26)                                              /**< (IP1553_TXBAER) Transmit error 26, x with x=[0-31] Position */
#define IP1553_TXBAER_TER26_Msk               (_U_(0x1) << IP1553_TXBAER_TER26_Pos)                /**< (IP1553_TXBAER) Transmit error 26, x with x=[0-31] Mask */
#define IP1553_TXBAER_TER26(value)            (IP1553_TXBAER_TER26_Msk & ((value) << IP1553_TXBAER_TER26_Pos))
#define IP1553_TXBAER_TER27_Pos               _U_(27)                                              /**< (IP1553_TXBAER) Transmit error 27, x with x=[0-31] Position */
#define IP1553_TXBAER_TER27_Msk               (_U_(0x1) << IP1553_TXBAER_TER27_Pos)                /**< (IP1553_TXBAER) Transmit error 27, x with x=[0-31] Mask */
#define IP1553_TXBAER_TER27(value)            (IP1553_TXBAER_TER27_Msk & ((value) << IP1553_TXBAER_TER27_Pos))
#define IP1553_TXBAER_TER28_Pos               _U_(28)                                              /**< (IP1553_TXBAER) Transmit error 28, x with x=[0-31] Position */
#define IP1553_TXBAER_TER28_Msk               (_U_(0x1) << IP1553_TXBAER_TER28_Pos)                /**< (IP1553_TXBAER) Transmit error 28, x with x=[0-31] Mask */
#define IP1553_TXBAER_TER28(value)            (IP1553_TXBAER_TER28_Msk & ((value) << IP1553_TXBAER_TER28_Pos))
#define IP1553_TXBAER_TER29_Pos               _U_(29)                                              /**< (IP1553_TXBAER) Transmit error 29, x with x=[0-31] Position */
#define IP1553_TXBAER_TER29_Msk               (_U_(0x1) << IP1553_TXBAER_TER29_Pos)                /**< (IP1553_TXBAER) Transmit error 29, x with x=[0-31] Mask */
#define IP1553_TXBAER_TER29(value)            (IP1553_TXBAER_TER29_Msk & ((value) << IP1553_TXBAER_TER29_Pos))
#define IP1553_TXBAER_TER30_Pos               _U_(30)                                              /**< (IP1553_TXBAER) Transmit error 30, x with x=[0-31] Position */
#define IP1553_TXBAER_TER30_Msk               (_U_(0x1) << IP1553_TXBAER_TER30_Pos)                /**< (IP1553_TXBAER) Transmit error 30, x with x=[0-31] Mask */
#define IP1553_TXBAER_TER30(value)            (IP1553_TXBAER_TER30_Msk & ((value) << IP1553_TXBAER_TER30_Pos))
#define IP1553_TXBAER_TER31_Pos               _U_(31)                                              /**< (IP1553_TXBAER) Transmit error 31, x with x=[0-31] Position */
#define IP1553_TXBAER_TER31_Msk               (_U_(0x1) << IP1553_TXBAER_TER31_Pos)                /**< (IP1553_TXBAER) Transmit error 31, x with x=[0-31] Mask */
#define IP1553_TXBAER_TER31(value)            (IP1553_TXBAER_TER31_Msk & ((value) << IP1553_TXBAER_TER31_Pos))
#define IP1553_TXBAER_Msk                     _U_(0xFFFFFFFF)                                      /**< (IP1553_TXBAER) Register Mask  */

#define IP1553_TXBAER_TER_Pos                 _U_(0)                                               /**< (IP1553_TXBAER Position) Transmit error 3x, x with x=[x-3x] */
#define IP1553_TXBAER_TER_Msk                 (_U_(0xFFFFFFFF) << IP1553_TXBAER_TER_Pos)           /**< (IP1553_TXBAER Mask) TER */
#define IP1553_TXBAER_TER(value)              (IP1553_TXBAER_TER_Msk & ((value) << IP1553_TXBAER_TER_Pos)) 

/** \brief IP1553 register offsets definitions */
#define IP1553_CR_REG_OFST             (0x00)              /**< (IP1553_CR) Configuration Register Offset */
#define IP1553_CMDR1_REG_OFST          (0x0C)              /**< (IP1553_CMDR1) Command Register 1 Offset */
#define IP1553_CMDR2_REG_OFST          (0x10)              /**< (IP1553_CMDR2) Command Register 2 Offset */
#define IP1553_CMDR3_REG_OFST          (0x14)              /**< (IP1553_CMDR3) Command Register 3 Offset */
#define IP1553_BITR_REG_OFST           (0x18)              /**< (IP1553_BITR) BIT Register Offset */
#define IP1553_VWR_REG_OFST            (0x1C)              /**< (IP1553_VWR) Vector Word Register Offset */
#define IP1553_IER_REG_OFST            (0x20)              /**< (IP1553_IER) IRQ Mask Enable Register Offset */
#define IP1553_IDR_REG_OFST            (0x24)              /**< (IP1553_IDR) IRQ Mask Disable Register Offset */
#define IP1553_IMR_REG_OFST            (0x28)              /**< (IP1553_IMR) IRQ Mask Register Offset */
#define IP1553_ISR_REG_OFST            (0x2C)              /**< (IP1553_ISR) IRQ Status Register Offset */
#define IP1553_CTRL1_REG_OFST          (0x30)              /**< (IP1553_CTRL1) Control Register 1 Offset */
#define IP1553_CTRL2_REG_OFST          (0x34)              /**< (IP1553_CTRL2) Control Register 2 Offset */
#define IP1553_CTRL3_REG_OFST          (0x38)              /**< (IP1553_CTRL3) Control Register 3 Offset */
#define IP1553_ARW_REG_OFST            (0x3C)              /**< (IP1553_ARW) Address Register Write Offset */
#define IP1553_ARR_REG_OFST            (0x40)              /**< (IP1553_ARR) Address Register Read Offset */
#define IP1553_RXBSR_REG_OFST          (0x44)              /**< (IP1553_RXBSR) Rx Buffer Status Register Offset */
#define IP1553_RXBAER_REG_OFST         (0x48)              /**< (IP1553_RXBAER) Rx Buffer Access Error Register Offset */
#define IP1553_TXBSR_REG_OFST          (0x4C)              /**< (IP1553_TXBSR) Tx Buffer Status Register Offset */
#define IP1553_TXBAER_REG_OFST         (0x50)              /**< (IP1553_TXBAER) Tx Buffer Access Error Register Offset */

