Microchip-MPLAB-Harmony/motor_control/apps/pmsm_foc_encoder_lx7720_sam_rh71_ek/firmware/src/packs/ATSAMRH71F20C_DFP/component/ip1553.h
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
/** \brief IP1553 register API structure */
typedef struct
{
  __IO  uint32_t                       IP1553_CR;          /**< Offset: 0x00 (R/W  32) Configuration Register */
  __I   uint8_t                        Reserved1[0x08];
  __O   uint32_t                       IP1553_CMDR1;       /**< Offset: 0x0C ( /W  32) Command Register 1 */
  __O   uint32_t                       IP1553_CMDR2;       /**< Offset: 0x10 ( /W  32) Command Register 2 */
  __O   uint32_t                       IP1553_CMDR3;       /**< Offset: 0x14 ( /W  32) Command Register 3 */
  __O   uint32_t                       IP1553_BITR;        /**< Offset: 0x18 ( /W  32) BIT Register */
  __O   uint32_t                       IP1553_VWR;         /**< Offset: 0x1C ( /W  32) Vector Word Register */
  __O   uint32_t                       IP1553_IER;         /**< Offset: 0x20 ( /W  32) IRQ Mask Enable Register */
  __O   uint32_t                       IP1553_IDR;         /**< Offset: 0x24 ( /W  32) IRQ Mask Disable Register */
  __I   uint32_t                       IP1553_IMR;         /**< Offset: 0x28 (R/   32) IRQ Mask Register */
  __I   uint32_t                       IP1553_ISR;         /**< Offset: 0x2C (R/   32) IRQ Status Register */
  __I   uint32_t                       IP1553_CTRL1;       /**< Offset: 0x30 (R/   32) Control Register 1 */
  __I   uint32_t                       IP1553_CTRL2;       /**< Offset: 0x34 (R/   32) Control Register 2 */
  __I   uint32_t                       IP1553_CTRL3;       /**< Offset: 0x38 (R/   32) Control Register 3 */
  __IO  uint32_t                       IP1553_ARW;         /**< Offset: 0x3C (R/W  32) Address Register Write */
  __IO  uint32_t                       IP1553_ARR;         /**< Offset: 0x40 (R/W  32) Address Register Read */
  __IO  uint32_t                       IP1553_RXBSR;       /**< Offset: 0x44 (R/W  32) Rx Buffer Status Register */
  __IO  uint32_t                       IP1553_RXBAER;      /**< Offset: 0x48 (R/W  32) Rx Buffer Access Error Register */
  __IO  uint32_t                       IP1553_TXBSR;       /**< Offset: 0x4C (R/W  32) Tx Buffer Status Register */
  __IO  uint32_t                       IP1553_TXBAER;      /**< Offset: 0x50 (R/W  32) Tx Buffer Access Error Register */
} ip1553_registers_t;


#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */
#endif /* _SAMRH71_IP1553_COMPONENT_H_ */
